public class Main {
    public static void main(String[] args) {
        // Задание 1
        int age = 7;
        if (age >= 18) {
            System.out.println("Поздравляем с совершеннолетием!");
        }
        if (age < 18) {
            System.out.println("Вам еще нет 18 лет!");
        }
        //Задание 2
        int age2 = 19;
        if (age2 >= 7) {
            System.out.println("Ребенок ходит в школу");
        }
        if (age2 >= 18) {
            System.out.println("Человек учится в университете");
        }
        if (age2 >= 24) {
            System.out.println("Человек работает");
        }

    }
}